In [1]:
import numpy as np
import pandas as pd

### Series
- series는 암묵적, 명시적 인덱스 편하게 사용가능하다
- iloc loc으로 보다 직관적으로 인덱스 가능

#### update
- indexing, slicing 편하게 사용 가능 (loc iloc 포함)

In [3]:
series01 = pd.Series(range(5),index=['a','b','c','d','e'])
series01

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [5]:
# indexing 을 통한 update
series01[0] = 100    # 암묵적 정수
print(series01) 
series01['d'] = 300  # 명시적 라벨링
print(series01)

a    100
b      1
c      2
d    300
e      4
dtype: int64
a    100
b      1
c      2
d    300
e      4
dtype: int64

In [14]:
# loc iloc도 동일한 매커니즘이다
series01.iloc[0] = 1000    # 암묵적 정수
print(series01) 
series01.loc['d'] = 3000  # 명시적 라벨링
print(series01)

a    1000
b    2000
c     300
d    3000
e     500
dtype: int64
a    1000
b    2000
c     300
d    3000
e     500
dtype: int64

In [10]:
# slicing 을 통한 update
series01[0:2] = [1000,2000]
print(series01)
series01['c':'e'] = [300,400,500]
print(series01)

a    1000
b    2000
c     300
d     400
e     500
dtype: int64
a    1000
b    2000
c     300
d     400
e     500
dtype: int64

#### append
- append할때는 반드시 label을 이용한 명시적 인덱스를 사용한다

In [18]:
# indexing을 통한 append
series01['f'] = 'new01'
print(series01)
series01.loc['g'] = 'new02'
print(series01)

a     1000
b     2000
c      300
d     3000
e      500
f    new01
dtype: object
a     1000
b     2000
c      300
d     3000
e      500
f    new01
g    new02
dtype: object

#### delete
- del 사용
- series.drop([labels],inplace=) 사용
    - drop함수는 label을 찾아서 지운다 => 정수 index하면 에러남
    - dataframe 에도 동일하게 label을 찾아가느데,축이 두개 이기 때문에 row indexd인지 column index 축 설정이 필요

In [24]:
# 'a' 하나만 지우기
series01.drop('a')

b     2000
c      300
d     3000
e      500
f    new01
g    new02
dtype: object

In [25]:
# 'a' 'b' 지우기
series01.drop(['a','b'])

c      300
d     3000
e      500
f    new01
g    new02
dtype: object

In [26]:
series01.drop(['f','g'],inplace=True)
series01

a    1000
b    2000
c     300
d    3000
e     500
dtype: object

### DataFrame

In [27]:
score_data = {
    'kor'  : [80,90,70,30],
    'eng'  : [90,70,60,40],
    'math' : [90,60,90,70] 
}

index   = ['김지은', '황인범', '김정수', '최호진']
df01 = pd.DataFrame(score_data,index=index)
display(df01)

     kor  eng  math
김지은   80   90    90
황인범   90   70    60
김정수   70   60    90
최호진   30   40    70

#### update
- indeixng slincg 편하게 하면 된다 (loc iloc 포함)
- 다만 return type이 몇차원인지 Series인지 Df인지 형태를 잘 파악할 필요가 있다

In [28]:
# 김지은 kor 점수 변경
df01.loc['김지은','kor'] = 100
display(df01)

     kor  eng  math
김지은  100   90    90
황인범   90   70    60
김정수   70   60    90
최호진   30   40    70

In [29]:
# 황인범 kor eng 변경
df01.loc['황인범','kor':'eng'] = [80,70]
display(df01)

     kor  eng  math
김지은  100   90    90
황인범   80   70    60
김정수   70   60    90
최호진   30   40    70

In [31]:
# kor 성적을 싹다 변경
df01['kor'] = [30,30,30,30]
display(df01)

     kor  eng  math
김지은   30   90    90
황인범   30   70    60
김정수   30   60    90
최호진   30   40    70

In [32]:
# kor eng 성적을 싹다 변경
df01[['kor','eng']] = [[20,20],[20,20],[20,20],[20,20]]
display(df01)

     kor  eng  math
김지은   20   20    90
황인범   20   20    60
김정수   20   20    90
최호진   20   20    70

#### append 
- df['col01'] => column 단위 인덱스
- df.loc['row01'] => row 단위 인덱스

In [33]:
# 행 추가
df01.loc['이강희'] = [100,100,100]
display(df01)

     kor  eng  math
김지은   20   20    90
황인범   20   20    60
김정수   20   20    90
최호진   20   20    70
이강희  100  100   100

In [34]:
# 열 추가
df01['his'] = [50,50,50,50,50]
display(df01)

     kor  eng  math  his
김지은   20   20    90   50
황인범   20   20    60   50
김정수   20   20    90   50
최호진   20   20    70   50
이강희  100  100   100   50

#### delete
- del 함수
    - 열만 지울수 있다 inplace=True로 실행된다
- DataFrame.drop(axis=,[labels],inplace=)
    - labels에 명시적 라벨을 사용한다 
    - axis=0 일때 행방향으로 라벨 찾아 행 지운다
    - axis=1 일때 열방향으로 라벨 찾아 열 지운다

In [36]:
display(df01)

     kor  eng  math  his
김지은   20   20    90   50
황인범   20   20    60   50
김정수   20   20    90   50
최호진   20   20    70   50
이강희  100  100   100   50

In [38]:
# 열지우기
del df01['his']
display(df01)

     kor  eng  math
김지은   20   20    90
황인범   20   20    60
김정수   20   20    90
최호진   20   20    70
이강희  100  100   100

In [40]:
# 행 지우기
df01.drop('이강희',axis=0,inplace=True)
display(df01)

     kor  eng  math
김지은   20   20    90
황인범   20   20    60
김정수   20   20    90
최호진   20   20    70

In [41]:
# 열 지우기
df01.drop('math',axis=1,inplace=True)
display(df01)

     kor  eng
김지은   20   20
황인범   20   20
김정수   20   20
최호진   20   20

In [42]:
# 여러개 동시에 지우기
df01.drop(['김지은','황인범'],axis=0,inplace=True)
display(df01)

     kor  eng
김정수   20   20
최호진   20   20

### Index는 보존된다
- 주로 datafarme의 열로 series 추가할때 이용된다

In [70]:
score_data = {
    'kor'  : [80,90,70,30],
    'eng'  : [90,70,60,40],
    'math' : [90,60,90,70] 
}

index   = ['김지은', '황인범', '김정수', '최호진']
df01 = pd.DataFrame(score_data,index=index)
display(df01)

     kor  eng  math
김지은   80   90    90
황인범   90   70    60
김정수   70   60    90
최호진   30   40    70

In [71]:
# index에 맞춰서 값이 들어간다
df01.loc['김지은'] = pd.Series([100,90,80],index = ['math','eng','kor'])
display(df01)

     kor  eng  math
김지은   80   90   100
황인범   90   70    60
김정수   70   60    90
최호진   30   40    70

In [72]:
# index에 맞춰서 값이 들어간다
df01['his'] = pd.Series([100,90,80,70],index = ['최호진','황인범','김지은','김정수'])
display(df01)

     kor  eng  math  his
김지은   80   90   100   80
황인범   90   70    60   90
김정수   70   60    90   70
최호진   30   40    70  100

In [73]:
# 인덱스의 개념이 여기서 좀 헷갈릴수 있는데 들어가는 위치를 잘 생각해보면 되낟
df01['his']

# 결과를 보면 index의 사람 이름이 있다 => 즉 index를 사람 이름으로 한 Series가 들어오면 알아서 맞게 들어간다

김지은     80
황인범     90
김정수     70
최호진    100
Name: his, dtype: int64